CapnRon/gnw-stm32h7b0-diag-firmware/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h7xx_hal.h"
#include "gw_buttons.h"
#include "gw_flash.h"
#include "gw_lcd.h"
#include "gw_linker.h"
#include "githash.h"
#include "flashapp.h"
#include "gw_psram_test.h"
#include "gw_ram_test.h"

#include "odroid_colors.h"
#include "odroid_system.h"
#include "odroid_overlay.h"
#include "bq24072.h"

#include <string.h>
#include <assert.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

DAC_HandleTypeDef hdac1;
DAC_HandleTypeDef hdac2;

LTDC_HandleTypeDef hltdc;

OSPI_HandleTypeDef hospi1;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA1;
DMA_HandleTypeDef hdma_sai1_a;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;

WWDG_HandleTypeDef hwwdg1;

/* USER CODE BEGIN PV */

#define BOOT_MODE_APP      0
#define BOOT_MODE_FLASHAPP 1

char logbuf[1024 * 4] PERSISTENT __attribute__((aligned(4)));
uint32_t log_idx PERSISTENT;
PERSISTENT volatile uint32_t boot_magic;

uint32_t boot_buttons;

uint32_t uptime_s;

static bool wdog_enabled;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void ensure_option_bytes(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_LTDC_Init(void);
static void MX_SPI2_Init(void);
static void MX_OCTOSPI1_Init(void);
static void MX_SAI1_Init(void);
static void MX_RTC_Init(void);
static void MX_DAC1_Init(void);
static void MX_DAC2_Init(void);
static void MX_WWDG1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */

void app_main(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


const char *fault_list[] = {
  [BSOD_ABORT] = "Assert",
  [BSOD_HARDFAULT] = "Hardfault",
  [BSOD_MEMFAULT] = "Memfault",
  [BSOD_BUSFAULT] = "Busfault",
  [BSOD_USAGEFAULT] = "Usagefault",
  [BSOD_WATCHDOG] = "Watchdog",
  [BSOD_OTHER] = "Other",
};

__attribute__((optimize("-O0"))) void BSOD(BSOD_t fault, uint32_t pc, uint32_t lr)
{
  char msg[256];
  size_t i = 0;
  char *start;
  char *end;
  char *line;
  int y = 2*8;

  __disable_irq();

  snprintf(msg, sizeof(msg), "FATAL EXCEPTION: %s %s\nPC=0x%08lx LR=0x%08lx\n", fault_list[fault], GIT_HASH, pc, lr);

  lcd_sync();
  lcd_reset_active_buffer();
  odroid_display_set_backlight(ODROID_BACKLIGHT_LEVEL6);

  odroid_overlay_draw_text(0, 0, GW_LCD_WIDTH, msg, C_RED, C_BLUE);

  // Print each line from the log in reverse
  end = &logbuf[strnlen(logbuf, sizeof(logbuf)) - 1];
  while (y < GW_LCD_HEIGHT) {
    // Max 28 lines
    if (i++ >= 28) {
      break;
    }

    // Find the last line start not beyond end (inefficient but simple solution)
    start = logbuf;
    while (start < end) {
      line = start;
      start = strnstr(start, "\n", end - start);
      if (start == NULL) {
        break;
      } else {
        // Move past \n
        start += 1;
      }
    }

    // Terminate the previous line
    end[0] = '\x00';

    end = line;

    y += odroid_overlay_draw_text(0, y, GW_LCD_WIDTH, line, C_WHITE, C_BLUE);

    if (line == logbuf) {
      // No more lines to print
      break;
    }
  }

  // Wait for a button press (allows a user to hold and release a button when the BSOD occurs)
  uint32_t old_buttons = buttons_get();
  while ((buttons_get() == 0 || (buttons_get() == old_buttons))) {
    wdog_refresh();
  }

  // Encode the fault type in the boot magic
  boot_magic = BOOT_MAGIC_BSOD | (fault & 0xffff);

  HAL_NVIC_SystemReset();

  // Does not return
  while (1) {
    __NOP();
  }
}

// Used by assert()
void abort(void)
{
  BSOD(BSOD_ABORT, 0, 0);
}

#if 1
int _write(int file, char *ptr, int len)
{
  if (log_idx + len + 1 > sizeof(logbuf)) {
    log_idx = 0;
  }

  memcpy(&logbuf[log_idx], ptr, len);
  log_idx += len;
  logbuf[log_idx + 1] = '\0';

  return len;
}
#endif

void store_erase(const uint8_t *flash_ptr, uint32_t size)
{
  // Only allow addresses in the areas meant for erasing and writing.
  assert(
    ((flash_ptr >= &__SAVEFLASH_START__)   && ((flash_ptr + size) <= &__SAVEFLASH_END__)) ||
    ((flash_ptr >= &__configflash_start__) && ((flash_ptr + size) <= &__configflash_end__)) ||
    ((flash_ptr >= &__fbflash_start__) && ((flash_ptr + size) <= &__fbflash_end__))
  );

  // Convert mem mapped pointer to flash address
  uint32_t save_address = flash_ptr - &__EXTFLASH_BASE__;

  // Only allow 4kB aligned pointers
  assert((save_address & (4*1024 - 1)) == 0);

  // Round size up to nearest 4K
  if ((size & 0xfff) != 0) {
    size += 0x1000 - (size & 0xfff);
  }

  OSPI_DisableMemoryMappedMode();
  OSPI_EraseSync(save_address, size);
  OSPI_EnableMemoryMappedMode();
}

void store_save(const uint8_t *flash_ptr, const uint8_t *data, size_t size)
{
  // Temporary solution to make things work with flash with 256K erase pages
#ifdef DISABLE_STORE
  return;
#endif

  // Convert mem mapped pointer to flash address
  uint32_t save_address = flash_ptr - &__EXTFLASH_BASE__;

  // Only allow 4kB aligned pointers
  assert((save_address & (4*1024 - 1)) == 0);

  int diff = memcmp((void*)flash_ptr, data, size);
  if (diff == 0) {
    return;
  }

  store_erase(flash_ptr, size);

  OSPI_DisableMemoryMappedMode();
  OSPI_Program(save_address, data, size);
  OSPI_EnableMemoryMappedMode();
}

void boot_magic_set(uint32_t magic)
{
  boot_magic = magic;
}

