CapnRon/gnw-stm32h7b0-diag-firmware/Core/Src/main.c
  HAL_SAI_DMAStop(&hsai_BlockA1); /* in case a previous clip's DMA is still circularly running */
  HAL_SAI_Transmit_DMA(&hsai_BlockA1, (uint8_t *)snd_dbuf, 2u * SND_HALF_SAMPLES);
  snd_playback_start_tick = HAL_GetTick();
}
#endif /* sound playback disabled */

void wdog_enable()
{
  MX_WWDG1_Init();
  wdog_enabled = true;
}

void wdog_refresh()
{
  if (wdog_enabled) {
    HAL_WWDG_Refresh(&hwwdg1);
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  uint8_t trigger_wdt_bsod = 0;
  uint8_t boot_mode = BOOT_MODE_APP;

  for(int i = 0; i < 1000000; i++) {
    __NOP();
  }

  // Nullpointer redzone
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wnonnull"
  memset(0x0, '\x41', (size_t)&__NULLPTR_LENGTH__);
#pragma GCC diagnostic pop

  // Don't reset the logbuf when rebooting from a watchdog reset
  if (boot_magic != BOOT_MAGIC_WATCHDOG) {
    log_idx = 0;
    logbuf[0] = '\0';
  }

  switch (boot_magic) {
  case BOOT_MAGIC_STANDBY:
    printf("Boot from standby.\nboot_magic=0x%08lx\n", boot_magic);
    break;
  case BOOT_MAGIC_RESET:
    printf("Boot from warm reset.\nboot_magic=0x%08lx\n", boot_magic);
    break;
  case BOOT_MAGIC_WATCHDOG:
    printf("Boot from watchdog reset!\nboot_magic=0x%08lx\n", boot_magic);
    trigger_wdt_bsod = 1;
    break;
  case BOOT_MAGIC_FLASHAPP:
    boot_mode = BOOT_MODE_FLASHAPP;
    break;
  default:
    if ((boot_magic & BOOT_MAGIC_BSOD_MASK) == BOOT_MAGIC_BSOD) {
      uint16_t fault_idx = boot_magic & 0xffff;
      const char *fault = (fault_idx < BSOD_COUNT) ? fault_list[fault_idx] : "UNKOWN";
      printf("Boot from BSOD:\nboot_magic=0x%08lx %s\n", boot_magic, fault);
    } else {
      printf("Boot from brownout?\nboot_magic=0x%08lx\n", boot_magic);
    }
    break;
  }

  // Leave a trace that indicates a warm reset
  boot_magic = BOOT_MAGIC_RESET;

  // Reset the log write pointer
  log_idx = 0;

  /* USER CODE END 1 */

  /* Self-healing option bytes: this device's option register was previously
   * corrupted by an unrelated tool doing a full 32-bit option_write with no
   * mask, wiping IWDG_SW/NRST_STDY/NRST_STOP/IWDG_FZ_* bits to 0. Restore
   * the known-good value (verified against a reference unit) on every boot,
   * but only actually write if it's already wrong -- option byte flash has
   * far lower write endurance than regular flash. */
  ensure_option_bytes();

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  // Power pin as Input
  HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN1_LOW);

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_LTDC_Init();
  MX_SPI2_Init();
  MX_OCTOSPI1_Init();
  MX_SAI1_Init();
  MX_RTC_Init();
  MX_DAC1_Init();
  MX_DAC2_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */

  // Save the button states as early as possible
  boot_buttons = buttons_get();

  lcd_backlight_off();

  /* Power off LCD and external Flash */
  lcd_deinit(&hspi2);

  // Keep this
  // at least 8 frames at the end of power down (lcd_deinit())
  // 4 x 50 ms => 200ms
  for (int i = 0; i < 4; i++) {
    wdog_refresh();
    HAL_Delay(50);
  }

  /* Power on LCD and external Flash */
  lcd_init(&hspi2, &hltdc);

  // Keep this
  for (int i = 0; i < 4; i++) {
    wdog_refresh();
    HAL_Delay(50);
  }

  if (trigger_wdt_bsod) {
    BSOD(BSOD_WATCHDOG, 0, 0);
  }

  /* USER CODE END 2 */

  /* DIAGNOSTIC BUILD: IWDG_SW option byte flipped 0->1 (software-controlled)
   * so the hardware IWDG no longer force-starts at reset; all iwdg_kick()
   * calls removed to test that petting is genuinely no longer required. */
  SCB_EnableICache();
  SCB_EnableDCache();

  PSRAM_Init(&hospi1);

  {

    /* Backlight is DAC-driven and was turned off earlier (lcd_backlight_off()
     * before lcd_deinit()); nothing in this diagnostic path ever turns it
     * back on. */
    lcd_backlight_on();

    /* Battery/charge status: CHG pin auto-refreshes via EXTI, but PGOOD is
     * only sampled once here -- re-poll it periodically below. */
    bq24072_init();

    RamTest_RunAll();

    uint32_t last_change = HAL_GetTick();
    uint32_t prev_buttons = 0;
    uint32_t power_hold_start = 0;

    while (1) {
      wdog_refresh();

      uint32_t now = HAL_GetTick();
      if (now - last_change >= 1000) {
        last_change = now;
        bq24072_handle_power_good();
      }

      uint32_t cur_buttons = buttons_get();
      uint32_t newly_pressed = cur_buttons & ~prev_buttons;

      /* Hold POWER (bit9) for 5 seconds to power off. GW_EnterDeepSleep()
       * (main.c) is self-contained -- unlike odroid_system_sleep(), it does
       * not depend on the settings/filesystem/gui state this diagnostic
       * build never initializes. It re-arms the power button as a wakeup
       * source before entering STANDBY, so pressing POWER again wakes it. */
      if (newly_pressed & (1u << 9)) {
        power_hold_start = now;
      }
      if ((cur_buttons & (1u << 9)) && (now - power_hold_start >= 5000)) {
        GW_EnterDeepSleep();
      }
      prev_buttons = cur_buttons;

      odroid_overlay_draw_fill_rect(0, 0, GW_LCD_WIDTH, GW_LCD_HEIGHT, 0x0000);
      odroid_overlay_draw_text(4, 2, GW_LCD_WIDTH - 8, "RAM TEST", 0xFFFF, 0x0000);
      RamTest_DrawReport(4, 20, GW_LCD_WIDTH - 8);

      {
        odroid_battery_state_t batt = odroid_input_read_battery();
        const char *chg_str;
        switch (batt.state) {
          case ODROID_BATTERY_CHARGE_STATE_BATTERY_MISSING: chg_str = "NOBAT"; break;
          case ODROID_BATTERY_CHARGE_STATE_CHARGING:    chg_str = "CHG";   break;
          case ODROID_BATTERY_CHARGE_STATE_DISCHARGING: chg_str = "DISC";  break;
          case ODROID_BATTERY_CHARGE_STATE_FULL:        chg_str = "FULL";  break;
          default:                                      chg_str = "?";     break;
        }
        char batt_str[16];
        sprintf(batt_str, "%d%% %s", batt.percentage, chg_str);
        odroid_overlay_draw_text(GW_LCD_WIDTH - 88, GW_LCD_HEIGHT - 10, 86, batt_str, 0xFFFF, 0x0000);
      }

      {
        /* Set once by ensure_option_bytes() at boot -- see that function
         * for the known-good reference value this compares against. */
        const char *opt_str = option_bytes_were_ok ? "OPT:OK" : "OPT:FIXED";
        uint16_t opt_color = option_bytes_were_ok ? 0x07E0 /* green */ : 0xFFE0 /* yellow */;
        odroid_overlay_draw_text(4, GW_LCD_HEIGHT - 10, 86, opt_str, opt_color, 0x0000);
      }

      lcd_sync();
      lcd_swap();

      HAL_Delay(30);
    }
  }

  while (1)
  {
    /* USER CODE END WHILE */

